; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
; here write ENGLISH name of your language
LANG_NAME="English"
; here write NATIVE name of your language
LANG_NATIVE_NAME="Default"
VERSION=2.1
NAME=M. Brunjadze
; add 'mailto:' prefix if you type E-mail adress
CONTACT=mailto:mirza.b.1695@gmail.com

[Global]
TIP_ADD="Add"
TIP_EDIT="Edit"
TIP_DELETE="Delete"
TIP_DELETE_ALL="Delete All"
TIP_MOVE_UP="Move Up"
TIP_MOVE_DOWN="Move Down"
BTN_SAVE="Save"
BTN_CANCEL="Cancel"
CHK_QUOTES="Enclosed in quotes"
LST_SEC_QUOTES="Quotes"
ERROR_MSG_TITLE="Error!"
WARNING_MSG_TITLE="Warning"
INFORMATION_MSG_TITLE="Information"
QUESTION_MSG_TITLE="Question"
BTN_OK="OK"
TEST="Test"
TIP_BROWSE="Browse for file"
TIP_OPEN="Open file location"

[Menu]
MENU_FILE="&File"
MENU_SETTINGS="&Settings"
MENU_HELP="&Help"
MI_OPEN="&Open file..."
MI_RELOAD="R&eopen"
MI_SAVE="&Save"
MI_SAVE_AS="Save &as..."
MI_CLOSE="&Close"
SUB_MENU_RECENT_FILES="&Recent files"
MI_CLEAR_LIST="C&lear list"
MI_EXIT="E&xit"
MI_OPTIONS="&Options"
SUB_MENU_LANG="&Language"
MI_HELP="Hel&p"
MI_SITE="Project &site"
MI_ABOUT="A&bout"
MI_PRESET_MANAGER="Preset Manager"

[ToolbarTips]
OPEN="Open file"
SAVE="Save"
SAVE_AS="Save as"
CLOSE="Close file"
TEST="Test"
PRESET="Manage presets"
MAKE_SFX="Make SFX"
OPTIONS="Program options"

[TabNames]
MAIN="Main"
TITLE_TEXT="Title/Text"
DIALOGS="Dialogs"
RUN="Run"
DELETE="Delete"
SHORTCUTS="Shortcuts"
SET_ENV="SetEnvironment"
OUTPUT="Output"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE="TempMode"
CHK_SKIP_LOCKED="Skip system locked files"
CHK_DELETE_SFX="Delete SFX File after extraction"
CHK_BPT="BeginPrompt Timeout:"
CHK_XDWIDTH="ExtractDialog Width:"
CHK_XPWIDTH="ExtractPath Width:"
CHK_VOLNAME="Volume name style:"
RAD_OW_MODE_1="Overwrite all files"
RAD_OW_MODE_2="Do not overwrite files"
RAD_OW_MODE_3="Overwrite older files"
RAD_GUI_MODE_1="Show all GUI"
RAD_GUI_MODE_2="Disable Cancel when extracting"
RAD_GUI_MODE_3="Hide all GUI window"
GRP_OW_MODE="Overwrite Mode:"
GRP_GUI_MODE="GUI Mode:"
LBL_EXT_PATH="Extraction Path:"
MI_SFX_NAME="SFX Name"
MI_SFX_PATH="SFX Path"
TIP_EDIT="Click to edit"
TIP_INSERT="Click to insert variables"
TIP_RELOAD="Reload"
TIP_OPEN="Open with default text editor"

[Tab_TitleText]
GRP_TITLE="Title"
GRP_TEXT="Text"
LBL_WIN_TITLE="Window Title:"
LBL_EXT_PATH_WIN_TITLE="Extract Path Window Title:"
LBL_EXT_WIN_TITLE="Extract Title:"
LBL_ERROR_WIN_TITLE="Error Message Title:"
LBL_WARN_WIN_TITLE="Warning Message Title:"
LBL_PASSWD_TITLE="Password Title:"
LBL_PASSWD_TEXT="Password Text:"
LBL_EXT_CANCEL_TEXT="Extract Cancel Text:"

[Tab_RunProgram]
LST_SEC_PARAMETER="Parameter"
LST_SEC_PREFIX="Prefix"
LST_SEC_FILE_FOLDER="File Path"
LST_SEC_COMMANDS="Commands"

[Tab_Delete]
LST_SEC_PARAMETER="Parameter"
LST_SEC_FILE_FOLDER="File/Folder Path"

[Tab_Shortcuts]
LST_SEC_PARAMETER="Parameter"
LST_SEC_PATH="Path"
LST_SEC_SRC="Source"
LST_SEC_CMDS="Commands"
LST_SEC_NAME="Name"
LST_SEC_DESC="Description"
LST_SEC_DEST="Destination"
LST_SEC_WD="Working Directory"
LST_SEC_ICON="Icon"
LST_SEC_INDEX="Index"

[Tab_SetEnvironment]
LST_SEC_NAME="Variable Name"
LST_SEC_VALUE="Value"

[Tab_SFX]
BTN_SELECT="Select..."
BTN_MAKE_SFX="Make SFX"
BTN_SFX_OPTIONS="SFX Options"
BTN_EDIT_VERS="Edit Version Info"
CHK_INCLUDE_PATH="Include path into configuration file"
CHK_USE_SELECTED_CFG="Use selected configuration file"
GRP_SFX_FILES="SFX Files"
GRP_SFX_ICON="Icon"
LBL_CONFIG_FILE="Configuration file:"
LBL_7Z_ARCHIVE="7z Archive:"
LBL_SFX_MODULE="SFX Module:"
LBL_SFX_PATH="SFX Path:"
LBL_SFX_ICON="SFX Icon:"

[GUI_ProgramOptions]
GUI_TITLE="Program options"
BTN_INTEGRATE="Integrate program in the context menu"
BTN_EXPORT="Export..."
MI_REGISTRY="Registry file..."
MI_INI="INI file..."
CHK_USERMODE="Save settings in the registry"
CHK_AUTODEFMOD="Automatically use default module if loaded config doesn't contain it"
CHK_IGNORE_EMPTY="Don't create empty version info keys"
CHK_AUTO_NAME_SFX="Create SFX file in the archive's directory if SFX path isn't defined"
CHK_OVERWRITE_FILES="Overwrite existing SFX files"
GRP_PROGRAM="Program"
GRP_SFX="SFX"
LBL_LANGUAGE="Interface language:"

[GUI_PresetManager]
GUI_TITLE="Preset Manager"
GUI_TITLE2="New Preset"
GUI_TITLE3="Rename Preset"
BTN_NEW="New"
BTN_LOAD="Load"
BTN_SAVE="Save"
BTN_EDIT="Edit name"
BTN_DELETE="Delete"
LBL_NAME="Type preset name:"

[GUI_ArchiveSets]
CHK_SUBFILES="Archive only files/folders located in given folder"
LBL_DRAGDROP="You can use Drag and Drop function to add files/folders"
TIP_ADDFILE="Add file(s)"
TIP_ADDFOLDER="Add folder"

[GUI_SFXOpts]
GUI_TITLE="SFX Options"
TAB_SFX_OPTIONS="SFX Options"
TAB_ARCHIVE_FILES="Archive Files"
CHK_USE_UPX="Compress SFX module with UPX"
CHK_USE_SFX_MOD="Use following SFX module:"
CMB_USE_7ZIP1="Always use 7-Zip"
CMB_USE_7ZIP2="Use 7-Zip only if archive files are specified"
CMB_USE_7ZIP3="Don't use 7-Zip if 7z Archive is specified"
CMB_USE_7ZIP4="Never use 7-Zip"
LBL_PATH="7-Zip path"
TIP_BROWSE="Select 7-Zip path"
TIP_CONFIG="7-Zip configuration"
7ZIP_TITLE="7-Zip configuration"
7ZIP_LEVEL="Compression level:"
7ZIP_METHOD="Compression method:"
7ZIP_DICT="Dictionary size:"
7ZIP_SOLID="Solid Block size:"

[GUI_VersionInfo]
GUI_TITLE="Edit file version info"
BTN_LOAD="Load"
MI_LOAD_SFXMOD="From selected SFX module"
MI_LOAD_FILE="From file..."
MI_LOAD_VALUES="Load saved"
MI_SAVE_VALUES="Save current values"
CHK_INCLUDE="Include information into configuration file"
CHK_CHANGE_VERS="Change version info"

[GUI_Gui.MiscFlags]
GUI_TITLE="Edit GUI/Misc Flags"
BTN_NEW="New"
BTN_LOAD="Load"
BTN_RESET="Reset"
BTN_DELETE="Delete"
LBL_GUI_FLAG_1="Show the extraction percentage in the TitleBar on the right (by default - on the left)"
LBL_GUI_FLAG_2="Don't display the extraction percentage in the TitleBar"
LBL_GUI_FLAG_4="Show the extraction percentage under ProgressBar"
LBL_GUI_FLAG_8="Use Windows XP styles (scheme)"
LBL_GUI_FLAG_16="Use bold font for the extraction percentage"
LBL_GUI_FLAG_32="Display an icon in the window of the extraction progress"
LBL_GUI_FLAG_64="Use window 'BeginPrompt' to specify extraction path"
LBL_GUI_FLAG_128="Use separate window to specify extraction path"
LBL_GUI_FLAG_256="Confirm the abolition of the installation/extraction"
LBL_GUI_FLAG_512="Don't display an icon in the TitleBar of all the windows and on [Alt+Tab]"
LBL_GUI_FLAG_1024="Display an icon in the window for specifying extraction path"
LBL_GUI_FLAG_2048="Display an icon in the window 'BeginPrompt'"
LBL_GUI_FLAG_4096="Change an icon and button names. Instead of 'Yes'-'No' would be 'OK'-'Cancel'"
LBL_GUI_FLAG_8192="Don't show ProgressBar on the TaskBar under Windows 7 or later"
LBL_GUI_FLAG_16384="Show '&&' symbol in the texts"
LBL_MISC_FLAG_1="Don't verify free disk space needed for the extraction"
LBL_MISC_FLAG_2="Don't verify free RAM needed for the extraction"
LBL_MISC_FLAG_4="Require administrator privilegies for the all operation"
LBL_MISC_FLAG_8="Show password request window after 'BeginPrompt' and 'ExtractPath' windows"

[GUI_RunProgram]
GUI_TITLE="Add programs to run after extraction"
GUI_PFX_TITLE="Edit prefixes"
LBL_PARAMETER="Parameter:"
LBL_FILE="File:"
LBL_PREFIX="Prefix:"
LBL_COMMANDS="Commands:"

[GUI_Delete]
GUI_TITLE="Add files to delete after extraction"
LBL_PARAMETER="Parameter:"
LBL_FILE="File/Folder:"

[GUI_Shortcuts]
GUI_TITLE="Add shortcuts to create"
RAD_DESKTOP="Desktop"
RAD_START_MENU="Start Menu"
RAD_PROGRAMS="Start Menu\Programs"
RAD_STARTUP="Startup"
RAD_CURRENT_USER="Current User"
RAD_ALLUSERS="All Users"
GRP_CREATION_PATH="Where to create"
GRP_CREATE_FOR="Create for"
GRP_PARAMETER="Parameter:"
LBL_SOURCE_FILE="Source file:"
LBL_ARGUMENTS="Arguments:"
LBL_NAME="Shortcut name:"
LBL_DESCRIPTION="Shortcut description:"
LBL_DEST_FOLDER="Destination folder:"
LBL_WORKING_DIR="Working directory:"
LBL_ICON_FILE="Icon file:"
LBL_ICON_INDEX="Icon index:"

[GUI_SetEnvironment]
GUI_TITLE="Create environment variables"
LBL_NAME="Name:"
LBL_VALUE="Value:"

[GUI_MakeSFX]
GUI_TITLE="Creating SFX..."
BTN_OPEN="Browse"
BTN_RUN="Run SFX"
BTN_CLOSE="Close"
REPORT_PREP="Preparing..."
REPORT_ARCHIVE1="Creating archive..."
REPORT_ARCHIVE2="7-Zip doesnt exist!"
REPORT_ARCHIVE3="File doesn't exist: \~s"
REPORT_ARCHIVE4="Archive created successfully"
REPORT_ARCHIVE5="Couldn't create archive!"
REPORT_ERROR1="Can't find configuration file: \~s"
REPORT_ERROR2="The following file isn't 7z SFX configuration file: \~s"
REPORT_ERROR3="Error while creating SFX!"
REPORT_ICON1="Changing SFX icon..."
REPORT_ICON2="SFX icon changed successfully"
REPORT_ICON3="Can't change SFX icon!"
REPORT_VERSINFO1="Updating version info..."
REPORT_VERSINFO2="Version info updated successfully"
REPORT_VERSINFO3="Can't update version info!"
REPORT_UPX1="Compressing with UPX..."
REPORT_UPX2="Compression completed successfully"
REPORT_UPX3="Can't find "upx.exe"!"
REPORT_BUILD1="Building SFX..."
REPORT_BUILD2="Error while building SFX!"
REPORT_FINISH="SFX created successfully at: \~s"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="Unable to find language file!"
MSGBOX1_2="Specified file doesn't exist!"
MSGBOX1_3="File isn't loaded or doesn't exist!"
MSGBOX1_4="Specified configuration file doesn't exist!"
MSGBOX1_5="Do you want to open file: \~n\~s - ?"
MSGBOX1_6="\~s\nisn't 7z SFX configuration file!\~nDo you want to load it anyway?"
MSGBOX1_7="The file size is larger than normal configuration file!\nWould you like to load it anyway?"
MSGBOX1_8="File required for current operation is missing:\n\s"
MSGBOX1_9="This file doesn't contain configuration file! Unable to continue!"
MSGBOX1_10="Are you sure you want to reload file?"
MSGBOX1_11="Current configuration isn't saved. Do you want to save it now?"
MSGBOX1_12="Unable to read or write file! Make sure you have administrator privileges."
; SFX creation
MSGBOX2_1="Path to the specified SFX file doesn't exist!"
MSGBOX2_2="SFX module isn't specified!"
MSGBOX2_3="Specified SFX module doesn't exist or doesn't have required format!"
MSGBOX2_4="Archive files aren't specified!"
MSGBOX2_5="Archive isn't specified!"
MSGBOX2_6="Specified archive doesn't exist or doesn't have required format!"
MSGBOX2_7="Do you want to overwrite existing file: \~n\~s - ?"
MSGBOX2_8="7-Zip doesnt exist!"
MSGBOX2_9="Do you want to use following archive file: \~n\~s - ?\~nClick 'No' if you want to create new archive from files defined in configuration file."
; Other operations
MSGBOX3_1="Program successfully integrated in the context menu."
MSGBOX3_2="Press 'OK' to close window for testing"
MSGBOX3_3="Do you want to overwrite existing values?"
MSGBOX3_4="Please, select at least one item."
MSGBOX3_5="Please, select only one item."
MSGBOX3_6="Are you sure you want to delete selected item(s)?"
MSGBOX3_7="Are you sure you want to delete all items?"
MSGBOX3_8="Specified data is invalid or empty!"
MSGBOX3_9="File isn't specified!"
